In [1]:
import pandas as pd 
import numpy as np

In [50]:

data = {
    '종목코드' : ["037730","036360","005670"],
    '종목명' : ["3R","3SOFT","ACTS"],
    '현재가' : [1510,1790,1185]
}

df = pd.DataFrame(data)

In [51]:
print(df)

     종목코드    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005670   ACTS  1185

In [16]:
data = [
    ["037730", "3R", 1510],
    ["036360", "3SOFT", 1790],
    ["005670", "ACTS", 1185],
]

columns = ['종목코드','종목명','현재가']

In [17]:
df2 = pd.DataFrame(data= data,columns=columns)

In [18]:
print(df2)

     종목코드    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005670   ACTS  1185

In [19]:
data = [
    {"종목코드": "037730", "종목명": "3R", "현재가": 1510},
    {"종목코드": "036360", "종목명": "3SOFT", "현재가": 1790},
    {"종목코드": "005760", "종목명": "ACTS", "현재가": 1185},
]

df3 = pd.DataFrame(data)

In [20]:
print (df3)

     종목코드    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [21]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005670", "ACTS", 1185, 1.28]
]

columns = ["종목코드", "종목명", "현재가", "등락률"]

df4 = pd.DataFrame(data=data,columns=columns)

In [22]:
print(df4)

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005670   ACTS  1185  1.28

In [23]:
df5 = df4.set_index('종목코드')

In [24]:
print(df5)

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005670   ACTS  1185  1.28

In [26]:
df4.set_index("종목코드", inplace = True)

In [27]:
print(df4)

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005670   ACTS  1185  1.28

In [35]:
#Indexing 

print(df4["현재가"])

종목코드
037730    1510
036360    1790
005670    1185
Name: 현재가, dtype: int64

In [36]:
print(df.현재가)

0    1510
1    1790
2    1185
Name: 현재가, dtype: int64

In [43]:
print(df4[['현재가','등락률']])

         현재가   등락률
종목코드
037730  1510  7.36
036360  1790  1.65
005670  1185  1.28

In [45]:
df['현재가']

0    1510
1    1790
2    1185
Name: 현재가, dtype: int64

In [56]:
df5.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [57]:
df.iloc[0]

종목코드    037730
종목명         3R
현재가       1510
Name: 0, dtype: object

In [60]:
print(df5.loc[['037730','005670']])

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005670  ACTS  1185  1.28

In [61]:
result = df5.loc[['037730','005670']]

In [64]:
result.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [65]:
df5.iloc[0].iloc[1]

1510

In [66]:
from pandas import DataFrame

data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = DataFrame(data=data)
df

        cd      nm   close
0  A060310      3S   2,920
1  A095570  AJ네트웍스   6,250
2  A006840   AK홀딩스  29,700
3  A054620  APS홀딩스  19,400

In [67]:
#cd 에 A 제거  다시 저장ㅇ 

df['cd']

0    A060310
1    A095570
2    A006840
3    A054620
Name: cd, dtype: object

In [68]:
df['cd'] = df['cd'].str[1:]

In [69]:
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

In [70]:
#close , 제거 후 숫자로 전환 
df['close'] = df['close'].str.replace(',','').astype(np.int64)

In [71]:
df

       cd      nm  close
0  060310      3S   2920
1  095570  AJ네트웍스   6250
2  006840   AK홀딩스  29700
3  054620  APS홀딩스  19400